     A*****************************************************************
     A**                                                             **
     A**    DSPF    TITLE -受注入力画面                            **
     A**            ID    - PRI03RD                                  **
     A**                                                             **
     A*****************************************************************
     A                                      CA03(03 '終了')
     A*****************************************************************
     A** 指示レコード
     A*****************************************************************
     A          R FMT01
     A                                      TEXT('指示レコード')
     A                                      OVERLAY
     A                                  1  3'PRI04R'
     A                                  1 31'**受注入力**'
     A                                      DSPATR(RI HI)
     A            X1MODE         6      1 50TEXT('処理区分') DSPATR(HI)
     A                                  1 65'日付'
     A                                  1 72DATE
     A                                      EDTWRD('0  /  /  ')
     A            X1WSID        10      2  3TEXT('WS-ID')
     A                                  2 65'時刻'
     A                                  2 72TIME
     A                                  5  8'受注番号：'
     A            X1BANG         5  0B  5 23TEXT('受注番号')
     A                                      EDTCDE(Z)
     A  61                                  DSPATR(RI PC)
     A*****************************************************************
     A** 応答レコード：サブファイル・レコード
     A*****************************************************************
     A          R SFL01                     SFL
     A                                      TEXT('SFLレコード')
     A            Y1HINB         5   B  8  5TEXT('品目番号')
     A  62                                  DSPATR(RI PC)
     A            Y1NAKN        20      8 12TEXT('品目名カナ')
     A            Y1UTAN         5  0   8 35TEXT('定価')
     A                                      EDTCDE(1)
     A            Y1SURY         3  0B  8 45TEXT('数量')
     A  63                                  DSPATR(RI PC)
     A                                      EDTCDE(1)
     A            Y1KING         9  0   8 53TEXT('金額')
     A                                      EDTCDE(J)
     A**行を空けるためのコーディング
     A                                  9  3' '
     A*****************************************************************
     A** 応答レコード：サブファイル制御レコード
     A*****************************************************************
     A          R CTL01                     TEXT('SFLCTLレコード')
     A                                      OVERLAY  PROTECT
     A                                      CF05(05 'データ処理')
     A                                      CA12(12 '前画面')
     A                                      SFLCTL(SFL01)
     A  33                                  SFLDSPCTL
     A  34                                  SFLDSP
     A  32                                  SFLCLR
     A  36                                  SFLEND(*MORE)
     A                                      SFLSIZ(15) SFLPAG(5)
     A            H1RCDN         4S 0H      SFLRCDNBR
     A                                  7  4'品番'
     A                                  7 11'品名カナ'
     A                                  7 34'定価'
     A                                  7 44'数量'
     A                                  7 57'金　額'
     A*****************************************************************
     A** コマンド指示レコード
     A*****************************************************************
     A          R FMT90                     TEXT('コマンド指示レコード')
     A                                 23  4'F3=終了'
     A  41                             23 15'F5=処理'
     A  41                             23 26'F12=前画面'
     A  60        X9MSG         60   O 24  4TEXT('エラーメッセージ')
     A                                      DSPATR(HI)
