     A*****************************************************************
     A**                                                             **
     A**    PROGRAM TITLE -得意先マスター照会画面                  **
     A**            ID    - INT01RD                                  **
     A**                                                             **
     A*****************************************************************
     A                                      CA03(03 '終了')
     A*****************************************************************
     A** 指示レコード
     A*****************************************************************
     A          R FMT01                     TEXT('指示レコード')
     A                                      OVERLAY
     A                                  1  3'TRY01R'
     A                                  1 31'**得意先照会**'
     A                                      DSPATR(RI HI)
     A                                  1 65'日付'
     A                                  1 72DATE EDTCDE(Y)
     A                                  5  8'得意先番号：'
     A            X1BANG         5A  B  5 23TEXT('得意先番号')
     A  60                              5 30'該当データが存在しません。'
     A                                      DSPATR(HI BL)
     A*****************************************************************
     A** 応答レコード
     A*****************************************************************
     A          R FMT02                     TEXT('応答レコード')
     A                                      OVERLAY PROTECT
     A                                  8  8'得意先名　：'
     A            X1CSKJ        20A  O  8 23TEXT('得意先名')
     A                                 10  8'郵便番号　：'
     A            X1POST         7A  O 10 23TEXT('郵便番号')
     A                                 12  8'住所　　　：'
     A            X1ADR1        20A  O 12 23TEXT('住所１')
     A            X1ADR2        20A  O 13 23TEXT('住所２')
     A                                 15  8'電話番号　：'
     A            X1TELE        13   O 15 23TEXT('電話番号')
     A*****************************************************************
     A** コマンド指示レコード
     A*****************************************************************
     A          R FMT90                     TEXT('コマンド指示レコード')
     A                                 23  4'F3=終了'
